#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main() {
//	//数组
//	// 一组相同类型的元素的集合
//	//数组用下标来访问，首个元素下标为0
//	int arr1[5] = { 2,5,6,46,3 }; 
//	//数据类型 数组名[元素个数]={元素}
//	char arr2[5] = { 'a','b','c'};//数组不完全初始化，剩下的值为0
//	int i = 0;
//	while (i < 5) {
//		printf("%d\t", arr1[i]);
//		printf("%c\n", arr2[i]);
//		i++;
//	}
//
//	printf("*********************************************\n");
//
//	//操作符
//	//算术操作符：
//	// +加法    -减法    *乘法    /除法    %取模
//	int a = 9 / 2;
//	float b = 9 / 2;
//	printf("%d\t%f\n", a, b);//整数除法，结果只得到商。
//
//	int a1 = 9.0 / 2;
//	float b1 = 9.0 / 2;
//	printf("%d\t%f\n", a1, b1);
//	//若要结果为小数，则需要除数或被除数为浮点数，且以浮点型打印
//
//	//移位操作符：
//	// >>右移操作符  <<左移操作符
//	int a2 = 5;
//	int b2 = a << 1;//a的二进制序列向左移动一位
//	printf("%d\n", b2);
//
//	//位操作符：
//	// &按位与  |按位或   ^按位异或
//	
//	//赋值操作符：
//	// ==    +=    -=    *=    /=    %=    ^=    |=    >>=    <<=
//	
//	//单目操作符：
//	// !逻辑取反    -负值    +正值    &取地址    sizeof操作数的类型长度
//	// ~对一个数的二进制按位取反    --    ++    *间接访问操作符（解引用操作符）    (类型)强制类型转换
//	
//	// ~按位取反：把所有二进制位中数字，1与0互换
//	int c = 0;// c--00000000000000000000000000000000
//	printf("%d\n", ~c);// ~c--11111111111111111111111111111111
//	//此输出结果为-1
//	//整数在内存中储存的是补码
//
//	printf("****************************************************");
//
//	//
//
//	return 0;
//}