#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////操作符
//int main() {
//
//	// ~ 按位取反符
//	int a = 0;
//	
//	printf("%d\n", ~a);// ~ 为按位(二进制位)取反符号：把所有二进制位中数字0变成1，而1变成0
//	//输出结果位-1
//
//	//整数在内存中存储的是补码
//	//整数的二进制表示有三种：1.原码 2.反码 3.补码
//	
//	//如-1：
//	//原码：10000000000000000000000000000001	第一位为符号位：1表示负数，0表示正数
//	//反码：11111111111111111111111111111110    原码的符号位不变，其他位按位取反，即为反码
//	//补码：11111111111111111111111111111111	反码的二进制序列加 1 即为补码
//	
//	//正整数原码、补码、反码相同。
//	
//
//	// ++ 与 --
//	//前置++：先进行++，后使用
//	int a1 = 10; int b1 = ++a1;
//	printf("%d\t%d\n", a1, b1);
//	//输出结果 a1=11，b1=11
//
//	//后置++：先使用，后进行++
//	int a2 = 10; int b2 = a2++;
//	printf("%d\t%d\n",a2,b2);
//	//输出结果 a2=11，b2=10
//
//
//	//（类型） 强制类型转换
//	int a3 = (int)3.14; //将浮点型强制转换为整型
//	printf("%d\n", a3);
//
//
//	//关系操作符
//	// ==等于 !=不等于
// 
//
//	//逻辑操作符
//	// && 逻辑与 (并且)
//	int a4 = 3; int b4 = 4;
//	int c4 = a4 && b4;
//	printf("%d\n", c4);
//	//输出结果为 1
//
//	// || 逻辑或(或者)
//	int a5 = 4; int b5 = 0;
//	int c5 = a5 || b5;
//	printf("%d\n", c5);
//	//输出结果 1
//
//
//	//条件操作符（三目操作符）
//	// exp1?exp2:exp3  ( ? : )
//	//exp1成立，exp2计算，整个表达式结果为exp2结果
//	//exp1不成立，exp3计算，整个表达式结果为exp3结果
//
//	int a6 = 5; int b6 = 2; int max = 0;
//	if (a6 > b6)
//		max = a6;
//	else
//		max = b6;
//	printf("%d\n", max);
//	//上述比大小等价于  max=a>b?a:b
//
//
//	//逗号表达式：逗号隔开的一串表达式
//	int a7 = 0; int b7 = 3; int c7 = 5;
//	int d7 = (a7 = b7 + 2, c7 = a7 - 4, b7 = c7 + 2);
//	//逗号表达式 从左往右依次计算，整个表达式结果为最后一个表达式的结果
//	printf("%d\n", d7);
//	//输出结果 3
//
//	
//	//下标引用、函数调用、结构成员
//	// []		()		  .   ->
//
//	//下表引用 []
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	printf("%d\n", arr[5]);//此方括号为下标引用操作符
//	//输出结果 6
//
//	//()调用函数时，函数名后面的()就是函数调用操作符
//
//
//	//常用的关键字
//	// auto break case char const continue default do double else enum 
//	// extern float for goto if int long register return short signed sizeof 
//	// static struct switch typedef union unsign void volatile while
//	//1.c语言提供，不能自创关键字
//	//2.变量名不能为关键字
//	
//	// auto 自动 ：每个局部变量都是auto修饰的
//	{
//		int a = 10;  //自动创建，自动销毁----自动变量。
//		//int前省略了auto
//	}
//	
//	// extern 用来申明外部符号
//
//	// register 寄存器关键字
//	//大量且频繁使用的数据，想放在寄存器中，提升效率
//	register int num = 100; //建议num的值存放在寄存器中
//
//	//计算机中，数据可存放于 （寄存器 高速缓存 内存 硬盘 网盘） 
//	                         //从右往左：造价越高、速度越快、空间越小
//
//	// signed 有符号的
//	// unsigned 无符号的
//
//	// static 静态的
//
//	// union 联合体（共用体）
//
//	// void 空的
//	
//	// define 和 include 不是关键字 ，而是预处理指令
//
//
//	return 0;
//}